[
  {
    "date": "Jan 09, 2026",
    "text": "Minecraft v1.21.132 works fine, feel free to update the game.",
    "text_es": "Minecraft 1.21.132 funciona bien, puedes actualizar el juego."
  },
  {
    "date": "Dec 17, 2025",
    "text": "v1.21.131 is compatible. You can update the game without any issues."
  },
  {
    "date": "Dec 16, 2025",
    "text": "MB Loader v2.5 is released!\r\n\r\nHighlights:\r\n- Support 1.21.130\r\n- New app icon\r\n- Added drop button [Q] overlay\r\n- Added crash handler activity\r\n- Minor bug fixes\r\n\r\nNote: Since MB Loader breaks often, we recommend you to open Minecraft page on Google Play, click the 3-dot menu, and untick \"Enable auto update\". Preferably, do the same for MB Loader as well so the game doesn't stop working suddenly.",
    "text_es": "¡Ya está salió MB Loader v2.5!\r\nEsta actualización trae lo siguiente:\r\n\r\n- Compatibilidad con Minecraft 1.21.130\r\n- Nuevo icono de la app\r\n- Se añadió el botón para dropear items [Q]\r\n- En caso de un crash, ahora se mostrará la causa\r\n- Corrección de errores menores\r\n\r\nNota: Cómo MB Loader suele romperse, te recomendamos abrir la página de Minecraft en Google Play, hacer clic en los tres puntos y desactivar la opción \"Activar actualización automática\". Preferiblemente, haz lo mismo con MB Loader para que el juego no deje de funcionar repentinamente."
  },
  {
    "date": "Dec 10, 2025",
    "text": "Minecraft v1.21.130 is not supported. Do not update the game.\nCompatibility update (v2.5) will be available within 1-3 days.",
    "text_es": "Minecraft v1.21.130 no es compatible. No actualices el juego.\nLa actualización de compatibilidad (v2.5) estará disponible en 1-3 días.",
    "isCritical": true
  },
  {
    "date": "Nov 26, 2025",
    "text": "MB Loader v2.4 is out! This update features following the following:\r\n\r\n- Minecraft v1.21.124+ compatibility (older versions may no longer work)\r\n- Fixed file import issue (thanks to github.com\/RadiantByte)\r\n- Fixed app not responding issue\r\n- Game now shows Minecraft logo at loading screen (thanks to github.com\/RadiantByte)\r\n- Direct launch shortcuts now work again\r\n- Added option to enable\/disable VSync for game\r\n- Full changelog can be found in About -> Changelog...",
    "text_es": "¡Ya salió MB Loader v2.4! Esta actualización trae lo siguiente:\r\n\r\n- Compatibilidad con Minecraft v1.21.124+ (versiones antiguas quizás no funcionen)\r\n- Se arregló el problema de importación de archivos (gracias github.com\/RadiantByte)\r\n- Se arregló el problema de que la aplicación no respondía\r\n- Ahora el juego muestra el logo de Minecraft en la pantalla de carga (gracias github.com\/RadiantByte)\r\n- Los accesos directos para abrir el juego funcionan de nuevo\r\n- Se añadió la opción para activar\/desactivar VSync para el juego\r\n- El registro de cambios completo se encuentra en Acerca de -> Registro de cambios...",
    "isCritical": true
  },
  {
    "date": "Nov 22, 2025",
    "text": "Minecraft v1.21.124 broke compatibility again. Please don't update the game for now.",
    "isCritical": true
  },
  {
    "date": "Nov 12, 2025",
    "text": "v2.3 is released. In this version, we have fixed the in-game data location switching issue and added v1.21.120+ compatibility.\r\n\r\nNotes:\r\n• 32 bit (armeabi-v7a) and Chromebooks (x86_64, x86) are not supported. You can check what you have from Settings tab -> Check preferred ABI.\r\n• On low end device, the game may freeze which can lead to app keep saying \"app not responding\" even if the game runs smoothly.\r\n• Minecraft version 1.21.101 or lower may not work as expected.\r\n• Game data location (app) and autofix related settings won't work for now.",
    "isCritical": true
  },
  {
    "date": "Nov 06, 2025",
    "text": "New MB Loader is coming soon.\nUnfortunately, we will have to drop support for 32 bit (armeabi-v7a) and Chromebook devices (x86_64, x86).\nYou can check what you have from Settings -> Check preferred ABI",
    "isCritical": true
  },
  {
    "date": "Oct 28, 2025",
    "text": "Minecraft v1.21.120 is released and once again it broke compatibility with MB Loader. It will take some time get things working again. So, please be patient for new MB Loader update and avoid updating to v1.21.120 for the time being."
  },
  {
    "date": "2025-10-23",
    "text": "MB Loader v2.2 is available now. This version added some behavior changes and option to change game data location. As mentioned before, the app has some issues and won't let Minecraft change data location to External, causing it to fallback to Application. The newly added option lets you change data location outside of Minecraft. You can set it to External to access data there. Note that the game will still show that Application is selected but it will save data in External. Also, you may need to login again and redownload marketplace/server addons, you may need to set some Minecraft settings again also. The option can be found in the Settings tab of MB Loader app. For any questions, please join our Discord server from About tab."
  },
  {
    "date": "2025-10-19",
    "text": "We just noticed that switching 'External' data location doesn't work. This may cause the game to fallback to 'Application'. So, if you had data in External. Those may not appear. In that case you can use the 'Backup Minecraft data' option in app settings. Then restore the backup to 'Application'. For any questions, please join our Discord server from About tab."
  },
  {
    "date": "2025-10-18",
    "text": "MB Loader v2.1 is available now. Note that compatibility is not guaranteed on Chromebooks and older Android devices (especially Samsung). We have also added in-app announcements. So you can stay up to date about any ongoing issues regarding the app."
  }
]
